---
kind: type
id: T:Autodesk.Revit.UI.ToggleButton
source: html/aaef4d8d-18bd-4245-51be-bfc1740f8053.htm
---
# Autodesk.Revit.UI.ToggleButton

The ToggleButton object represents a button that has been added to a RadioButtonGroup.

## Syntax (C#)
```csharp
public class ToggleButton : PushButton
```

## Remarks
Use of this class is not supported in Revit Macros.